---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LoadFailures.InvalidAreaLoadSketchError
source: html/846627f8-ad1e-664c-af5b-97ff05c0b682.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LoadFailures.InvalidAreaLoadSketchError Property

Area Load has invalid Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidAreaLoadSketchError { get; }
```